ci_project1/app/Controllers/frontend/RegistrationController.php

    public function registration()
    {
        $userModel = new UserModel();
        $json = $this->request->getVar();
        //$data = json_decode($json);
        //print_r($json);
        $data = [
            'name' => $json['fname'],
            'email' => $json['email'],
            'password' => $json['password'],
        ];

        $data['msg'] = "Success";


        // if($userModel->insert($data)){
        //     $data['msg'] = "Success";
        //     return $this->respond($data);
        // } else {
        //     $data['msg'] = "Failed";
        //     return $this->respond($data);
        // }
         $userModel->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Imran', 'imran@gmail.com', 'abcd')