ci_project1/app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $this->products->join('category', 'category.id = products.category_id');
        $data['items'] = $this->products->findAll();

SELECT *
FROM `category`
---
    public function create(){
        $data['cats'] = $this->category->findAll();