ci_project1/app/Controllers/SigninController.php

    public function login(){

        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getVar('email');
        $formpass = $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'masum@gmail.com'
 LIMIT 1